In [5]:
%matplotlib inline
import matplotlib.pyplot as plt
plt.style.use('my_custom_style')
import pandas as pd
from sqlalchemy import create_engine
from datetime import date, timedelta
import calendar

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

from itables import show
pd.options.display.max_rows = 31

engine = create_engine("sqlite:///c:\\ruby\\expense\\db\\development.sqlite3")
conn = engine.connect()
today = date.today()
today

Bad key axes.color_cycle in file C:\Users\PC1\.matplotlib\stylelib\my_custom_style.mplstyle, line 14 ('axes.color_cycle: 1f77b4, ff7f0e, 2ca02c, d62728, 9467bd, 8c564b, e377c2, 7f7f7f, bcbd22, 17becf')
You probably need to get an updated matplotlibrc file from
https://github.com/matplotlib/matplotlib/blob/v3.9.2/lib/matplotlib/mpl-data/matplotlibrc
or from the matplotlib source distribution

datetime.date(2025, 1, 31)

In [7]:
import matplotlib
import matplotlib.pyplot as plt
import os

# Get config directory
config_dir = matplotlib.get_configdir()
print(f"Matplotlib config directory: {config_dir}")

# Create stylelib directory
stylelib_dir = os.path.join(config_dir, 'stylelib')
os.makedirs(stylelib_dir, exist_ok=True)
print(f"Stylelib directory: {stylelib_dir}")

# Get full path for style file
style_file = os.path.join(stylelib_dir, 'my_custom_style.mplstyle')
print(f"Style file should be at: {style_file}")

# Check if file exists
if os.path.exists(style_file):
    print("Style file exists!")
else:
    print("Style file not found!")

Matplotlib config directory: C:\Users\PC1\.matplotlib
Stylelib directory: C:\Users\PC1\.matplotlib\stylelib
Style file should be at: C:\Users\PC1\.matplotlib\stylelib\my_custom_style.mplstyle
Style file exists!

In [9]:
style_content = """figure.figsize: 12, 7
figure.edgecolor: white
figure.facecolor: white

lines.linewidth: 2.5
lines.markeredgewidth: 0
lines.markersize: 10
lines.dash_capstyle: butt

legend.fancybox: True

font.size: 14

axes.color_cycle: 1f77b4, ff7f0e, 2ca02c, d62728, 9467bd, 8c564b, e377c2, 7f7f7f, bcbd22, 17becf
axes.linewidth: 0
axes.titlesize: 22
axes.labelsize: 16

xtick.labelsize: 14
ytick.labelsize: 14
xtick.major.size: 0
xtick.minor.size: 0
ytick.major.size: 0
ytick.minor.size: 0

axes.grid: True
grid.alpha: 0.3
grid.linewidth: 0.5
grid.linestyle: --
grid.color: black

savefig.transparent: False
savefig.bbox: tight
savefig.format: png"""

# Write the style file
with open(style_file, 'w') as f:
    f.write(style_content)

# Now try to use the style
plt.style.use('my_custom_style')

634

In [11]:
sql = "SELECT C.id, C.name AS item, G.name AS kind, G.id FROM categories C \
       JOIN groups G ON group_id = G.id"
df_c = pd.read_sql(sql, conn)
df_c.head()

   id              item            kind  id
0   1  Books & Software     Edutainment   3
1   2               CCF          Luxury   5
2   3         Cigarette          Luxury   5
3   4              Food            Food   4
4   5              Fuel  Transportation  10

In [13]:
# create a date object
date = pd.to_datetime('2024-11-30')

# find the beginning of the month for the given date
bom = date.to_period('M').start_time
eom = date.to_period('M').end_time
bom = bom.date()
eom = eom.date()
print(f'Month start: {bom}')
print(f'Month end: {eom}')

Month start: 2024-11-01
Month end: 2024-11-30

In [15]:
sql = """
SELECT date,amount,C.name AS item, G.name AS kind FROM transactions T 
JOIN categories C ON category_id = C.id 
JOIN groups G ON group_id = G.id 
WHERE date = "%s" 
ORDER BY amount DESC
"""
sql = sql % eom
print(sql)

df = pd.read_sql(sql, conn)
df

SELECT date,amount,C.name AS item, G.name AS kind FROM transactions T
JOIN categories C ON category_id = C.id
JOIN groups G ON group_id = G.id
WHERE date = "2024-11-30"
ORDER BY amount DESC

         date  amount            item           kind
0  2024-11-30   10000          Parent         Parent
1  2024-11-30     700         ChatGPT    Edutainment
2  2024-11-30     640   Internet Home  Communication
3  2024-11-30     420         Netflix    Edutainment
4  2024-11-30     320  Telephone Dtac  Communication
5  2024-11-30     210           Apple    Edutainment
6  2024-11-30     170          Google    Edutainment

In [17]:
formatted_amt = '{:,.2f}'.format(df.amount.sum())
print(formatted_amt)

12,460.00

In [19]:
sql = """
SELECT date,amount,C.name AS item, G.name AS kind FROM transactions T 
JOIN categories C ON category_id = C.id 
JOIN groups G ON group_id = G.id 
WHERE date = "%s" 
ORDER BY amount DESC
"""
sql = sql % (eom)
print(sql)

df_eom = pd.read_sql(sql, conn)
df_eom

SELECT date,amount,C.name AS item, G.name AS kind FROM transactions T
JOIN categories C ON category_id = C.id
JOIN groups G ON group_id = G.id
WHERE date = "2024-11-30"
ORDER BY amount DESC

         date  amount            item           kind
0  2024-11-30   10000          Parent         Parent
1  2024-11-30     700         ChatGPT    Edutainment
2  2024-11-30     640   Internet Home  Communication
3  2024-11-30     420         Netflix    Edutainment
4  2024-11-30     320  Telephone Dtac  Communication
5  2024-11-30     210           Apple    Edutainment
6  2024-11-30     170          Google    Edutainment

In [21]:
sql = """
SELECT date,amount,C.name AS item, G.name AS kind FROM transactions T 
JOIN categories C ON category_id = C.id 
JOIN groups G ON group_id = G.id 
WHERE date BETWEEN "%s" AND "%s" 
ORDER BY date
"""
sql = sql % (bom, eom)
print(sql)

df_t = pd.read_sql(sql, conn)
df_t.tail()

SELECT date,amount,C.name AS item, G.name AS kind FROM transactions T
JOIN categories C ON category_id = C.id
JOIN groups G ON group_id = G.id
WHERE date BETWEEN "2024-11-01" AND "2024-11-30"
ORDER BY date

          date  amount            item           kind
12  2024-11-30     420         Netflix    Edutainment
13  2024-11-30     320  Telephone Dtac  Communication
14  2024-11-30     170          Google    Edutainment
15  2024-11-30     210           Apple    Edutainment
16  2024-11-30     700         ChatGPT    Edutainment

In [23]:
grouped = df_t.groupby("item")
grouped['amount'].sum()

item
Apple                 210
Books & Software     3700
ChatGPT               700
Food                 1840
Google                170
Internet Home         640
Netflix               420
Parent              10000
Pets                 8320
Telephone Dtac        320
Name: amount, dtype: int64

In [25]:
grouped = df_t.groupby("kind")
grouped['amount'].sum()

kind
Communication      960
Edutainment       5200
Food              1840
Parent           10000
Pets              8320
Name: amount, dtype: int64

In [27]:
expense = grouped.amount.sum()
formatted_amt = '{:,.2f}'.format(sum(expense))
print(formatted_amt)

26,320.00

In [29]:
import matplotlib
print(matplotlib.get_configdir())

C:\Users\PC1\.matplotlib

In [31]:
fig_path = "../fig/Expense-2501.png"
with plt.style.context("my_custom_style"):
    plt.figure(figsize=(12, 12))
    ax = expense.plot.pie(
        colors=["green", "red", "orange", "cyan", "yellow", "blue", "gold"],
        startangle=90,
        autopct="%1.1f%%",
    )
    plt.savefig(fig_path)

In [33]:
expense.to_csv("../data/expense-2501.csv")

In [35]:
sql = """
SELECT date,amount,C.name AS item, G.name AS kind FROM transactions T 
JOIN categories C ON category_id = C.id 
JOIN groups G ON group_id = G.id 
WHERE date = "%s" 
ORDER BY date
"""
sql = sql % (eom)
print(sql)

SELECT date,amount,C.name AS item, G.name AS kind FROM transactions T
JOIN categories C ON category_id = C.id
JOIN groups G ON group_id = G.id
WHERE date = "2024-11-30"
ORDER BY date

In [37]:
df_tmp = pd.read_sql(sql, conn)
show(df_tmp[['date','amount','item','kind']])

In [39]:
df_tmp.to_csv("../data/expense-eom.csv")

In [41]:
sql = "SELECT * FROM groups"
groups = pd.read_sql(sql, conn)
groups.dtypes

id             int64
name          object
created_at    object
updated_at    object
factor4       object
dtype: object

In [43]:
groups

,id,name,created_at,updated_at,factor4
0,1,Apparel,2016-01-01 13:38:53.119230,2016-01-01 13:38:53.119230,2
1,2,Communication,2016-01-01 13:38:53.199234,2016-01-01 13:38:53.199234,5
2,3,Edutainment,2016-01-01 13:38:53.289240,2016-01-01 13:38:53.289240,6
3,4,Food,2016-01-01 13:38:53.356243,2016-01-01 13:38:53.356243,1
4,5,Luxury,2016-01-01 13:38:53.422247,2016-01-01 13:38:53.422247,6
5,6,Medicine,2016-01-01 13:38:53.498252,2016-01-01 13:38:53.498252,4
6,7,Others,2016-01-01 13:38:53.564255,2016-01-01 13:38:53.564255,6
7,8,Parent,2016-01-01 13:38:53.622259,2016-01-01 13:38:53.622259,7
8,9,Shelter,2016-01-01 13:38:53.689263,2016-01-01 13:38:53.689263,3
9,10,Transportation,2016-01-01 13:38:53.764267,2016-01-01 13:38:53.764267,5
10,11,Pets,2020-01-02 16:09:09,2020-01-02 16:09:09,8
11,12,Mother,2023-08-02 15:34:55,2023-08-02 15:34:55,9

In [45]:
sql = "SELECT * FROM categories"
categories = pd.read_sql(sql, conn)
categories.dtypes

id             int64
sequence       int64
name          object
default        int64
group_id       int64
created_at    object
updated_at    object
dtype: object

In [47]:
categories

,id,sequence,name,default,group_id,created_at,updated_at
0,1,4,Books & Software,0,3,2016-01-01 14:34:11.909054,2016-01-01 14:34:11.909054
1,2,19,CCF,600,5,2016-01-01 14:34:11.976058,2016-01-01 14:34:11.976058
2,3,2,Cigarette,0,5,2016-01-01 14:34:12.067063,2016-01-01 14:34:12.067063
3,4,1,Food,0,4,2016-01-01 14:34:12.148068,2016-01-01 14:34:12.148068
4,5,3,Fuel,0,10,2016-01-01 14:34:12.209071,2016-01-01 14:34:12.209071
...,...,...,...,...,...,...,...
38,39,76,Netflix,420,3,2022-06-30 15:12:52,2022-06-30 15:12:52
39,40,77,ChatGPT,690,3,2023-03-31 16:02:59,2023-03-31 16:02:59
40,41,78,MidJourney,350,3,2023-03-31 16:03:46,2023-03-31 16:03:46
41,42,79,Yearly Norton,1990,3,2023-09-03 08:17:21,2023-09-03 08:17:21
42,43,80,Microsoft 365,2900,3,2023-11-06 14:36:46,2023-11-06 14:36:46

In [49]:
sql = "SELECT * FROM transactions"
transactions = pd.read_sql(sql, conn)
transactions.dtypes

id              int64
date           object
category_id     int64
amount          int64
created_at     object
updated_at     object
dtype: object

In [51]:
transactions.tail()

,id,date,category_id,amount,created_at,updated_at
2999,3034,2025-01-31,39,420,2025-01-31 14:14:06.396405,2025-01-31 14:14:06.396405
3000,3035,2025-01-31,16,320,2025-01-31 14:14:21.876092,2025-01-31 14:14:21.876092
3001,3036,2025-01-31,32,170,2025-01-31 14:14:44.949300,2025-01-31 14:14:44.949300
3002,3037,2025-01-31,30,240,2025-01-31 14:15:02.256730,2025-01-31 14:15:02.256730
3003,3038,2025-01-31,40,700,2025-01-31 14:15:22.493743,2025-01-31 14:15:22.493743